In [2]:
import pandas as pd

In [7]:
okul = pd.read_excel('task4_1.xlsx', sheet_name=0)

In [8]:
okul

                   OKUL_ADI           MAHALLE
0           Kavaklıdere İÖO  Kavaklıdere Mah.
1  Etimesgut Anadolu Lisesi      Eryaman Mah.
2         Cumhuriyet Lisesi      Bozkurt Mah.
3            Zafer İlkokulu   Cumhuriyet Mah.

In [15]:
il = pd.read_excel('task4_1.xlsx', sheet_name=1)

In [16]:
il

         IL  Unnamed: 1
0  İSTANBUL         NaN
1    ANKARA         NaN
2     İZMİR         NaN
3   DENİZLİ         NaN

In [17]:
il = il[['IL']]

In [18]:
il

         IL
0  İSTANBUL
1    ANKARA
2     İZMİR
3   DENİZLİ

In [20]:
il_ilce = pd.read_excel('task4_1.xlsx', sheet_name=2)

In [21]:
il_ilce

         IL       ILCE
0    ANKARA    ÇANKAYA
1    ANKARA   ALTINDAĞ
2    ANKARA  ETİMESGUT
3  İSTANBUL      ŞİŞLİ

In [23]:
ilce_mahalle = pd.read_excel('task4_1.xlsx', sheet_name=3)

In [24]:
ilce_mahalle

      ILCE      MAHALLE
0  ÇANKAYA  KAVAKLIDERE
1  ÇANKAYA         ESAT
2  ÇANKAYA      AYRANCI
3  ÇANKAYA   CUMHURİYET
4    ŞİŞLİ      BOZKURT
5    ŞİŞLİ    ESKİŞEHİR
6    ŞİŞLİ   CUMHURİYET

In [44]:
okul.MAHALLE = okul.MAHALLE.str.replace('Mah.','').str.strip().str.lower()

In [45]:
okul

                   OKUL_ADI      MAHALLE
0           Kavaklıdere İÖO  kavaklidere
1  Etimesgut Anadolu Lisesi      eryaman
2         Cumhuriyet Lisesi      bozkurt
3            Zafer İlkokulu   cumhuriyet

In [46]:
ilce_mahalle.MAHALLE = ilce_mahalle.MAHALLE.str.strip().str.lower()

In [48]:
ilce_mahalle

      ILCE      MAHALLE
0  ÇANKAYA  kavaklidere
1  ÇANKAYA         esat
2  ÇANKAYA      ayranci
3  ÇANKAYA  cumhuri̇yet
4    ŞİŞLİ      bozkurt
5    ŞİŞLİ  eski̇şehi̇r
6    ŞİŞLİ  cumhuri̇yet

In [49]:
omi = okul.merge(ilce_mahalle, how= 'left', on = 'MAHALLE')

In [50]:
omi

                   OKUL_ADI      MAHALLE     ILCE
0           Kavaklıdere İÖO  kavaklidere  ÇANKAYA
1  Etimesgut Anadolu Lisesi      eryaman      NaN
2         Cumhuriyet Lisesi      bozkurt    ŞİŞLİ
3            Zafer İlkokulu   cumhuriyet      NaN

In [54]:
omi.ILCE = omi.ILCE.str.strip().str.lower()

In [55]:
omi

                   OKUL_ADI      MAHALLE     ILCE
0           Kavaklıdere İÖO  kavaklidere  çankaya
1  Etimesgut Anadolu Lisesi      eryaman      NaN
2         Cumhuriyet Lisesi      bozkurt  şi̇şli̇
3            Zafer İlkokulu   cumhuriyet      NaN

In [59]:
il_ilce.ILCE = il_ilce.ILCE.str.strip().str.lower()

In [61]:
omil = omi.merge(il_ilce, how = 'left', on ='ILCE')

In [62]:
omil

                   OKUL_ADI      MAHALLE     ILCE        IL
0           Kavaklıdere İÖO  kavaklidere  çankaya    ANKARA
1  Etimesgut Anadolu Lisesi      eryaman      NaN       NaN
2         Cumhuriyet Lisesi      bozkurt  şi̇şli̇  İSTANBUL
3            Zafer İlkokulu   cumhuriyet      NaN       NaN